6HJS/CC2640R2F_BLE5/source/ti/ble5stack/target/cc2642fpga/RFCC26XX_singleMode_tirtos2.20.00.06_tidrivers2.20.00.08_fpga.c
/*-------------- Global variables ---------------*/
// Pointer to current radio client (indicates also whether radio powered)
static RF_Object* pCurrClient;

// Keeps track of whether radio is active
static bool bRadioActive;

// Keep track of module state
static bool bInitialized = false;

// Current Radio FSM state
static Fsm_StateFxn pFsmState;

// Count of radio clients
static uint8_t nClients;
static uint8_t nActiveClients;

// Common RF command queue shared by all clients
static struct {
    RF_Cmd* volatile      pPend;     // Queue of RF_Cmds pending execution
    RF_Cmd* volatile      pCurrCmd;  // RF_Cmd currently executing
    RF_Cmd* volatile      pCurrCmdCb;// Holds current command while callback is processed
    RF_Cmd* volatile      pDone;     // Queue of RF_Cmds that are done but not retired
    RF_CmdHandle volatile nSeqPost;  // Sequence # for previously posted command
    RF_CmdHandle volatile nSeqDone;  // Sequence # for last done command
} cmdQ;

// RF_Cmd container pool. Containers with extra information about RF commands in flight
// These are organized as a circular array rather than a "retired" or "free" queue to
// facilitate mapping to the sequence numbers used as command handles
static RF_Cmd aCmdPool[N_CMD_POOL];

// SWIs and HWIs (structures + forward reference of handlers)
static Swi_Struct swiFsm;
static void swiFxnFsm(xdc_UArg a, xdc_UArg b);
static Hwi_Struct hwiCpe0;
static void hwiFxnCpe0PowerFsm(xdc_UArg a);
static void hwiFxnCpe0Active(xdc_UArg a);

static Swi_Struct swiHw;
static void swiFxnHw(xdc_UArg a, xdc_UArg b);
static Hwi_Struct hwiHw;
static void hwiFxnHw(xdc_UArg a);

// Clock used for triggering power-up sequences
static Clock_Struct clkPowerUp;
static void clkPowerUpFxn(xdc_UArg a);

// Default error callback
static void defaultErrCb(RF_Handle h, RF_CmdHandle ch, RF_EventMask e);

// RAT sync/start/stop radio operations
static union {
    rfc_CMD_SYNC_START_RAT_t start;
    rfc_CMD_SYNC_STOP_RAT_t  stop;
} opRatSync;

/* Default RF parameters structure */
static const RF_Params RF_defaultParams = {
    .nInactivityTimeout = BIOS_WAIT_FOREVER,
    .nPowerUpDuration   = RF_DEFAULT_POWER_UP_TIME,
    .bPowerUpXOSC       = true,
    .pPowerCb           = NULL,
    .pErrCb             = defaultErrCb,
};

// Powerup requested when powering down
static bool volatile bRestart;

// Internal abortCmd
static RF_Stat abortCmd(RF_Handle h, RF_CmdHandle ch, uint8_t type);

static uint32_t nRtc1;
static uint32_t nRtc2;
static uint32_t nRtc3;
static uint32_t activeTimeInUs;
static uint32_t volatile dispatchInUs;
static bool     bStart;

// Hardware attribute structure populated in board.c file to set HWI and SWI priorities
extern const RFCC26XX_HWAttrs RFCC26XX_hwAttrs;

// RAT channel allocate and free
static int8_t ratChanAlloc(RF_CmdDirImm *pCmd);
static void ratChanFree(int8_t ratChanNum);

// Initialize available RAT channels
static bool bInitAvailRatCh;

//Indicate when Radio is in power-up FSM
static bool bPowerUpActive;

//Indicate when Radio is in power-down FSM
static bool bPowerDownActive;

//Indicate if RF_yield requested to power-down the RF Core
static bool bYieldPwrDnCalled;

//Indicate request to cancel a power-down request from RF_yield
static bool bYieldPwrDnCancel;

/*-------------- Command queue internal functions ---------------*/

/* Peek at first entry in simple queue */
static RF_Cmd* Q_peek(RF_Cmd* volatile* ppHead)
{
    return (RF_Cmd*)*ppHead;
}

/* Pop first entry in simple queue */
static RF_Cmd* Q_pop(RF_Cmd* volatile* ppHead)
{
    RF_Cmd* pCmd;
    unsigned int key = Hwi_disable();
    if ((pCmd=(RF_Cmd*)*ppHead))
    {
        *ppHead = (RF_Cmd*)pCmd->pNext;
    }
    Hwi_restore(key);
    return pCmd;
}

/* Push entry onto simple queue */
static bool Q_push(RF_Cmd* volatile* ppHead, RF_Cmd* pCmd)
{
    RF_Cmd* pEnd = (RF_Cmd*)*ppHead;
    uint32_t key;

    pCmd->pNext = NULL;
    if (!pEnd)
    {
        // First entry into queue
        key = Hwi_disable();
        *ppHead = pCmd;
    }
    else
    {
        key = Hwi_disable();
        while (pEnd->pNext)
        {
            pEnd = (RF_Cmd*)pEnd->pNext;
        }

        // Sanity check - to avoid pEnd->pNext pointing to self
        if (pEnd == pCmd)
        {
            Hwi_restore(key);
            return false;
        }

        pEnd->pNext = pCmd;
    }
    Hwi_restore(key);

    return true;
}

/* Search last entry in simple queue  for particular client */
static RF_Cmd* Q_end(RF_Handle h, RF_Cmd* volatile* ppHead)
{
    RF_Cmd* pEnd = NULL;
    RF_Cmd* pClientEnd = NULL;

    uint32_t key = Hwi_disable();
    if ((pEnd = (RF_Cmd*)*ppHead))
    {
        pClientEnd = pEnd;
        while (pEnd->pNext)
        {
            pEnd = (RF_Cmd*)pEnd->pNext;
            pClientEnd = pEnd;
        }
    }
    Hwi_restore(key);

    return pClientEnd;
}

/* Allocate cmd buffer from cmd pool */
static RF_Cmd* allocCmd(RF_CmdHandle ch)
{
    uint8_t i;
    for (i = 0; i < N_CMD_POOL; i++)
    {
        if (!(aCmdPool[i].flags & RF_CMD_ALLOC_FLAG))
        {
            return &aCmdPool[i];
        }
    }
    return NULL;
}

/* Search cmd from cmd pool */
static RF_Cmd* getCmd(RF_CmdHandle ch)
{
    uint8_t i;
    for (i = 0; i < N_CMD_POOL; i++)
    {
        if ((aCmdPool[i].flags & RF_CMD_ALLOC_FLAG) && (aCmdPool[i].ch == ch))
        {
            return &aCmdPool[i];
        }
    }
    return NULL;
}

// Decrement client count and signal FSM to power down if it reaches 0
// Parameter is us until next command should be dispatched (0 means never)
static void decActiveClientCnt(uint32_t nUsUntilDispatch)
{
    uint32_t key = Hwi_disable();
    if (nActiveClients && (--nActiveClients == 0))
    {
        // Signal to power state machine that we can power down radio
        Swi_or(Swi_handle(&swiFsm), Fsm_EventPowerDown);

        if (nUsUntilDispatch)
        {

            Clock_stop(Clock_handle(&pCurrClient->state.clkInactivity));
            // Set clock object that will trigger radio wakeup
            Clock_setTimeout(Clock_handle(&clkPowerUp), (nUsUntilDispatch-(pCurrClient->clientConfig.nPowerUpDuration))/ Clock_tickPeriod);
            Clock_start(Clock_handle(&clkPowerUp));
        }
    }
    Hwi_restore(key);
}


// Check whether to dispatch operation immediately or power down radio and wait.
// If the former it returns 0, if the latter it returns the # microseconds until when
static uint32_t dispatchOpWhen(RF_Op* pOp)
{
    // Limitations:
    // - Only recognizes TRIG_ABSTIME triggers, everything else gets dispatched immediately
    if ((pOp->startTrigger.triggerType == TRIG_ABSTIME) && (!bRatActive))
    {
        int32_t deltaTimeUs = ((int32_t)(pOp->startTime/RF_NUM_RAT_TICKS_IN_1_US) - (int32_t)(RF_getCurrentTime()/RF_NUM_RAT_TICKS_IN_1_US));
        // check if startTime or currentTime has overflowed and adjust accordingly
        // Limitation: Assumes that the startTime is not more than MAX_TIME_IN_US/2 (~ 8.9 min)
        // compared to the currentTime
        if (deltaTimeUs >= (RF_DISPATCH_WRAP_AROUND_TIME_POS))
        {
            // currentTime has overflowed => past trigger case
            return 0;
        }
        else if (deltaTimeUs < (RF_DISPATCH_WRAP_AROUND_TIME_NEG))
        {
            // startTime has overflowed => add MAX_TIME_IN_US (in 32 bits) to deltaTimeUs
            deltaTimeUs += RF_DISPATCH_WRAP_AROUND_TIME_OFFSET;
        }
        if (deltaTimeUs > (int32_t)(pCurrClient->clientConfig.nPowerUpDuration + RF_DEFAULT_POWER_DOWN_TIME))
        {
            // We have time for a power cycle of RF core and system
            return (uint32_t)deltaTimeUs;
        }
    }
    return 0;
}


