6HJS/CC2640R2F_BLE5/source/ti/ble5stack/target/cc2642fpga/RFCC26XX_singleMode_tirtos2.20.00.06_tidrivers2.20.00.08_fpga.c
            // Dispatch immediately, set command to current and remove from pending queue
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
            HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = (uint32_t)pCmd->pOp;
            while(!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));

            Q_pop(&cmdQ.pPend);
            cmdQ.pCurrCmd = pCmd;
        }
    }
}


/* Clock callback due to inactivity timeout OR next pending command far into future */
static void clkInactivityFxn(RF_Object* pObj)
{
    // Decrement active client count and potentially signal to FSM that we can
    // power down radio
    decActiveClientCnt(0);
}


/* Callback used to post semaphore for runCmd() and waitCmd() */
static void syncCb(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if (h->state.pCbSync != NULL)
    {
        ((RF_Callback)h->state.pCbSync)(h, ch, e);
    }

    if ((e & RF_EventLastCmdDone) || (e & h->state.eventSync))
    {
        h->state.unpendCause = e;
        Semaphore_post(Semaphore_handle(&h->state.semSync));
    }
}

static void defaultErrCb(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    while(1);
}

/*-------------- RF powerup/powerdown FSM functions ---------------*/

// Affect FSM state change
static void FsmDispatch(RF_Object* pObj, Fsm_Event const e)
{
    pFsmState(pObj, e);
}


// Set target state to transition to
static void FsmNextState(Fsm_StateFxn pTarget)
{
    pFsmState = pTarget;
}


// The SWI handler for FSM events
static void swiFxnFsm(UArg a0, UArg a1)
{
    FsmDispatch(pCurrClient, (Fsm_Event)Swi_getTrigger());
}


/* Clock callback called upon powerup */
static void clkPowerUpFxn(xdc_UArg a)
{
    // Start time measurements
    if (pFsmState == fsmPowerUpState)
    {
        nRtc1  = AONRTCCurrent64BitValueGet();
    }

    // Trigger FSM SWI to get radio wakeup going
    Swi_or(Swi_handle(&swiFsm), Fsm_EventWakeup);
}


// The CPE0 ISR during FSM powerup/powerdown
static void hwiFxnCpe0PowerFsm(UArg a0)
{
    // Clear all IRQ flags in doorbell and then clear them
    uint32_t rfcpeifg = RFCCpeIntGetAndClear();

    if ((rfcpeifg & IRQ_BOOT_DONE) || (rfcpeifg & IRQ_LAST_COMMAND_DONE))
    {
        Swi_or(Swi_handle(&swiFsm), Fsm_EventPowerStep);
    }
}

/*-------------- Power management state functions ---------------*/
static void applyRfCorePatch(bool mode)
{
    // Patch CPE if relevant
    if (pCurrClient->clientConfig.pRfMode->cpePatchFxn)
    {
        pCurrClient->clientConfig.pRfMode->cpePatchFxn();
    }

    if ((pCurrClient->clientConfig.pRfMode->mcePatchFxn != 0) || (pCurrClient->clientConfig.pRfMode->rfePatchFxn != 0))
    {
        // Wait for clocks to turn on
        while(!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;

        // Patch if relevant
        if (pCurrClient->clientConfig.pRfMode->mcePatchFxn)
        {
            pCurrClient->clientConfig.pRfMode->mcePatchFxn();
        }

        // Patch if relevant
        if (pCurrClient->clientConfig.pRfMode->rfePatchFxn)
        {
            pCurrClient->clientConfig.pRfMode->rfePatchFxn();
        }

        // Turn off additional clocks
        RFCDoorbellSendTo(CMDR_DIR_CMD_2BYTE(RF_CMD0, 0));
    }
}

static void fsmPowerUpState(RF_Object *pObj, Fsm_Event e)
{
    // Note: pObj is NULL in this state
    if (e!=Fsm_EventWakeup)
    {
        return;
    }

    // Set current client from first command in command queue
    RF_Cmd* pNextCmd;
    RF_CmdDirImm* pCmdDirImm = &cmdDirImm;
    if ((pNextCmd = Q_peek(&cmdQ.pPend)))
    {
        pCurrClient = pNextCmd->pClient;
    }
    else if (pCmdDirImm->flags & RF_RUN_CMD_ON_RESTART_FLAG)
    {
        pCurrClient = pCmdDirImm->pClient;
    }

    // Keep track of mode
    HWREG(PRCM_BASE + PRCM_O_RFCMODESEL) = pCurrClient->clientConfig.pRfMode->rfMode;
    if (HWREG(PRCM_BASE + PRCM_O_RFCMODESEL) != pCurrClient->clientConfig.pRfMode->rfMode)
    {
        // Unsupported mode, do error callback
        if (pCurrClient->clientConfig.pErrCb)
        {
            RF_Callback pErrCb = (RF_Callback)pCurrClient->clientConfig.pErrCb;
            pErrCb(pCurrClient, RF_ERROR_INVALID_RFMODE, RF_EventError);
        }

    }

    // Register power dependency and constraints - i.e. power up RF.
    Power_setConstraint(PowerCC26XX_SB_DISALLOW);
    Power_setDependency(PowerCC26XX_DOMAIN_RFCORE);

    // Start power-up sequence
    bPowerUpActive = true;

    if((pCurrClient->clientConfig.bPowerUpXOSC == false) || bStart == 0)
    {
        Power_setDependency(PowerCC26XX_XOSC_HF);
    }

    // Turn on additional clocks on boot
    if ((pCurrClient->clientConfig.pRfMode->mcePatchFxn != 0) || (pCurrClient->clientConfig.pRfMode->rfePatchFxn != 0))
    {
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = CMDR_DIR_CMD_2BYTE(RF_CMD0, RFC_PWR_PWMCLKEN_MDMRAM | RFC_PWR_PWMCLKEN_RFERAM);
    }

    // Turn on clock to RF core
    RFCClockEnable();

    // Map all radio interrupts to CPE0 and enable some sources
    HWREG(RFC_DBELL_BASE+RFC_DBELL_O_RFCPEISL) = 0;

    HWREG(RFC_DBELL_BASE+RFC_DBELL_O_RFCPEIEN) =
            RFC_DBELL_RFCPEIEN_LAST_COMMAND_DONE_M |
            RFC_DBELL_RFCPEIEN_BOOT_DONE_M;

    // Next FSM state
    FsmNextState(&fsmSetupState);

    // Enable interrupts and let BOOT_DONE interrupt kick things off
    Hwi_enableInterrupt(INT_RFC_CPE_0);
}

static void fsmSetupState(RF_Object *pObj, Fsm_Event e)
{
    if (e & Fsm_EventPowerStep)
    {
        // Apply RF Core patch (if required)
        applyRfCorePatch(RF_PHY_BOOTUP_MODE);

        //Initialize bus request
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = CMDR_DIR_CMD_1BYTE(CMD_BUS_REQUEST, 1);

        // set VCOLDO reference
        RFCAdi3VcoLdoVoltageMode(true);

        // Next state: fsmActiveState
        FsmNextState(&fsmActiveState);

        // Setup RAT_SYNC command to follow SETUP command
        opRatSync.start.commandNo                = CMD_SYNC_START_RAT;
        opRatSync.start.status                   = IDLE;
        opRatSync.start.startTrigger.triggerType = TRIG_NOW;
        opRatSync.start.pNextOp                  = NULL;
        opRatSync.start.condition.rule           = COND_NEVER;    // Default: don't chain

        // Setup SETUP command
        RF_RadioSetup* pOpSetup         = pObj->clientConfig.pOpSetup;
        pOpSetup->prop.status           = IDLE;
        RF_Op* tmp                      = (RF_Op*)&pOpSetup->prop;
        while ((tmp->pNextOp) && (tmp->pNextOp->commandNo != CMD_SYNC_START_RAT))
        {
            tmp = tmp->pNextOp;
        }
        tmp->pNextOp                    = (RF_Op*)&opRatSync.start;
        tmp->condition.rule             = COND_ALWAYS;

        // Setup FS command to follow SETUP command
        rfc_CMD_FS_t* pOpFs;
        RF_Op* pOpFirstPend = Q_peek(&cmdQ.pPend)->pOp;
        if ((pOpFirstPend->commandNo != CMD_FS) && (pOpFirstPend->commandNo != CMD_FS_OFF) &&
            (pObj->state.mode_state.cmdFs.commandNo))
        {
            // Chain in the implicit FS command
            pOpFs                           = &pObj->state.mode_state.cmdFs;
            pOpFs->status                   = IDLE;
            pOpFs->pNextOp                  = NULL;
            pOpFs->startTrigger.triggerType = TRIG_NOW;
            pOpFs->condition.rule           = COND_NEVER;
            opRatSync.start.pNextOp         = (RF_Op*)pOpFs;
            opRatSync.start.condition.rule  = COND_ALWAYS;
        }

        // Set RF Trim values
        rfTrim_t rfTrim;
        RFCRfTrimRead((rfc_radioOp_t*)pObj->clientConfig.pOpSetup, (rfTrim_t*)&rfTrim);
        RFCRfTrimSet((rfTrim_t*)&rfTrim);

        // Check Override RTrim vs FCFG RTrim
        RFCRTrim((rfc_radioOp_t*)pObj->clientConfig.pOpSetup);

        // Make sure BUS_REQUEST is done
        while(!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;

