6HJS/CC2640R2F_BLE5/source/ti/ble5stack/target/cc2642fpga/RFCC26XX_singleMode_tirtos2.20.00.06_tidrivers2.20.00.08_fpga.c
#ifndef USE_FPGA  // FPGA never returns OSC_XOSC_HF
        // Split setup chain if XOSC_HF not ready
        if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF)
        {
            tmp->condition.rule = COND_NEVER;
            FsmNextState(&fsmXOSCState);
        }
#endif // USE_FPGA

        // Send chain
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = (uint32_t)&pObj->clientConfig.pOpSetup->commandId;
    }
}

#ifndef USE_FPGA
static void fsmXOSCState(RF_Object *pObj, Fsm_Event e)
{
    if ((e & Fsm_EventPowerStep) || (e & Fsm_EventWakeup))
    {
        if(OSCClockSourceGet(OSC_SRC_CLK_HF) == OSC_XOSC_HF)
        {
            FsmNextState(&fsmActiveState);

            // Do RAT sync
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = (uint32_t)&opRatSync.start;
        }
        else
        {
            // Schedule next polling
            Clock_setTimeout(Clock_handle(&clkPowerUp), RF_XOSC_HF_SWITCH_CHECK_PERIOD/Clock_tickPeriod);
            Clock_start(Clock_handle(&clkPowerUp));
        }
    }
}
#endif // USE_FPGA

static void fsmActiveState(RF_Object *pObj, Fsm_Event e)
{
    RF_Cmd* pCmd;
    RF_CmdDirImm* pCmdDirImm = &cmdDirImm;

    if (e & Fsm_EventCpeInt)
    {
        uint32_t key = Hwi_disable();
        pCmd = Q_peek(&cmdQ.pCurrCmdCb);
        uint32_t tmp = pCmd->rfifg;
        Hwi_restore(key);

        if (!(tmp & RF_EventLastCmdDone) && pCmd)
        {
            pCmd->rfifg &= (~tmp);
            if (pCmd->pCb)
            {
                pCmd->pCb(pCmd->pClient, pCmd->ch, (RF_EventMask)tmp);
            }
        }

        // We've handled this event now
        e &= ~Fsm_EventCpeInt;
    }
    else if (e & Fsm_EventLastCommandDone)
    {
        // Command done
        if ((pCmd = Q_peek(&cmdQ.pDone)))
        {
            // Update implicit radio state
            updateImplicitState(pCmd);

            uint32_t tmp = pCmd->rfifg;
            pCmd->rfifg = 0;
            // Call callback, free container and dequeue
            if (pCmd->pCb)
            {
                RF_EventMask cb_e = (RF_EventMask)(tmp | RF_EventLastCmdDone);
                switch (pCmd->flags & RF_CMD_CANCEL_MASK)
                {
                    case RF_CMD_ABORTED_FLAG:
                        cb_e = RF_EventCmdAborted;
                        break;
                    case RF_CMD_STOPPED_FLAG:
                        cb_e = RF_EventCmdStopped;
                        break;
                    case RF_CMD_CANCELLED_FLAG:
                        cb_e = RF_EventCmdCancelled;
                        break;
                    default:
                        break;
                }
                pCmd->pCb(pCmd->pClient, pCmd->ch, cb_e);
            }

            uint32_t key = Hwi_disable();
            cmdQ.nSeqDone = (cmdQ.nSeqDone+1)&N_CMD_MODMASK;
            cmdQ.pDone->flags &= ~RF_CMD_ALLOC_FLAG;
            Q_pop(&cmdQ.pDone);
            Hwi_restore(key);

            // Check if there are any more pending commands for this client
            if ((cmdQ.nSeqDone == pCmd->pClient->state.chLastPosted) && (!bRatActive))
            {
                // This was last posted command for client
                if (pCmd->pClient->state.bYielded || (pCmd->pClient->clientConfig.nInactivityTimeout == 0))
                {
                    // We can powerdown immediately
                    pCmd->pClient->state.bYielded = false;
                    decActiveClientCnt(0);
                }
                else
                {
                    if (pCurrClient->clientConfig.nInactivityTimeout != BIOS_WAIT_FOREVER)
                    {
                        // Start inactivity timer
                        Clock_setTimeout(Clock_handle(&pCmd->pClient->state.clkInactivity),
                                         pCmd->pClient->clientConfig.nInactivityTimeout/Clock_tickPeriod);
                        Clock_start(Clock_handle(&pCmd->pClient->state.clkInactivity));
                    }
                }
            }
        }
        // We've handled this event now
        e &= ~Fsm_EventLastCommandDone;
        if ((pCmd = Q_peek(&cmdQ.pDone)))
        {
            // Trigger self if there are more commands in callback queue
            e |= Fsm_EventLastCommandDone;
        }
    }
    else if (e & Fsm_EventPowerStep)
    {
        // Coming from powerup states

        // update power up duration if coming from the clkPowerUpFxn (nRtc not zero)
        if (nRtc1 && (OSCClockSourceGet(OSC_SRC_CLK_LF) != OSC_RCOSC_HF))
        {
            nRtc2  = AONRTCCurrent64BitValueGet();
            if (nRtc2 > nRtc1)
            {
                pObj->clientConfig.nPowerUpDuration = (nRtc2 - nRtc1) >> RF_RTC_CONV_TO_US_SHIFT;
            }
            else
            {
                pObj->clientConfig.nPowerUpDuration = (0xFFFFFFFF + nRtc2 - nRtc1) >> RF_RTC_CONV_TO_US_SHIFT;
            }

            // add margin to the power up duration to account for the TIRTOS/Drivers overhead
            pObj->clientConfig.nPowerUpDuration += RF_DEFAULT_POWER_UP_MARGIN;

            // power up duration should be within certain upper and lower bounds
            if ((pObj->clientConfig.nPowerUpDuration > RF_DEFAULT_POWER_UP_TIME) ||
                (pObj->clientConfig.nPowerUpDuration < RF_DEFAULT_MIN_POWER_UP_TIME))
            {
                pObj->clientConfig.nPowerUpDuration = RF_DEFAULT_POWER_UP_TIME;
            }
        }

        // reset nRtc1
        nRtc1 = 0;

        // Check the status of the CMD_FS, if it was sent (chained) to the setup command sent
        // during Fsm_EventChangePhy1 and return error callback to the client
        // client can either resend the CMD_FS or ignore the error as per Errata on PG2.1
        if (pObj->clientConfig.pErrCb)
        {
            if ((opRatSync.start.condition.rule == COND_ALWAYS) &&
                (pObj->state.mode_state.cmdFs.status == ERROR_SYNTH_PROG))
            {
                RF_Callback pErrCb = (RF_Callback)pObj->clientConfig.pErrCb;
                pErrCb(pObj, RF_ERROR_CMDFS_SYNTH_PROG, RF_EventError);
            }
        }

        // Change HWI handler
        Hwi_setFunc(Hwi_handle(&hwiCpe0), hwiFxnCpe0Active, (UArg)NULL);

        // Get the available RAT channel map
        if (bInitAvailRatCh)
        {
            rfc_CMD_GET_FW_INFO_t getFwInfoCmd;
            getFwInfoCmd.commandNo = CMD_GET_FW_INFO;
            RFCDoorbellSendTo((uint32_t)&getFwInfoCmd);
            pCmdDirImm->availRatCh = getFwInfoCmd.availRatCh;
            bInitAvailRatCh = false;
        }

