6HJS/CC2640R2F_BLE5/source/ti/ble5stack/target/cc2642fpga/RFCC26XX_singleMode_tirtos2.20.00.06_tidrivers2.20.00.08_fpga.c
/*-------------- API functions ---------------*/

RF_Handle RF_open(RF_Object *pObj, RF_Mode *pRfMode, RF_RadioSetup *pOpSetup, RF_Params *params)
{
    Assert_isTrue((pObj != NULL), NULL);

    // Initialize driver on first call
    if (!bInitialized)
    {
        rf_init();
        bInitialized = true;
    }

    if (pRfMode != NULL)
    {
        pObj->clientConfig.pRfMode = pRfMode;
    }
    else
    {
        return NULL;
    }

    if (pOpSetup != NULL)
    {
        pObj->clientConfig.pOpSetup = pOpSetup;
    }
    else
    {
        return NULL;
    }

    // Check whether RF driver is accepting more clients
    uint32_t key = Hwi_disable();
    if (nClients < N_MAX_CLIENTS)
    {
        nClients++;
    }
    else
    {
        Hwi_restore(key);
        return NULL;
    }
    Hwi_restore(key);

    // Populate default params if not provided
    RF_Params rfParams;
    if (params == NULL)
    {
        RF_Params_init(&rfParams);
        params = &rfParams;
    }

    // Initialize RF_Object config
    pObj->clientConfig.nInactivityTimeout     = params->nInactivityTimeout;
    pObj->clientConfig.nPowerUpDuration       = params->nPowerUpDuration;
    pObj->clientConfig.bPowerUpXOSC           = params->bPowerUpXOSC;
    pObj->clientConfig.pPowerCb               = (void *)params->pPowerCb;

    if (params->pErrCb)
    {
        pObj->clientConfig.pErrCb           = (void *)params->pErrCb;
    }

    // Initialize client state & variables
    memset(&pObj->state, 0, sizeof(pObj->state));

    // Initialize client semaphore and clock object
    union {
        Semaphore_Params sp;
        Clock_Params cp;
    } paramsUnion;

    Semaphore_Params_init(&paramsUnion.sp);
    paramsUnion.sp.mode = Semaphore_Mode_BINARY;
    Semaphore_construct(&pObj->state.semSync, 0, &paramsUnion.sp);
    Clock_Params_init(&paramsUnion.cp);
    paramsUnion.cp.arg = (UArg)pObj;
    Clock_construct(&pObj->state.clkInactivity, (Clock_FuncPtr)clkInactivityFxn, 0, &paramsUnion.cp);

    return pObj;
}


void RF_close(RF_Handle h)
{
    Assert_isTrue((h != NULL), NULL);

    // Wait for all issued commands to finish
    if(bInitialized)
    {
        if (cmdQ.nSeqPost != cmdQ.nSeqDone)
        {
            // Trace the end of pending queue for client h
            RF_Cmd *pCmd = Q_end(h, &cmdQ.pPend);
            if ((!pCmd) && (cmdQ.pCurrCmd))
            {
                // no pending commands for client h, current command is the last command
                pCmd = cmdQ.pCurrCmd;
            }
            if (pCmd)
            {
                RF_pendCmd(h, pCmd->ch, (RF_EventLastCmdDone | RF_EventCmdAborted | RF_EventCmdStopped | RF_EventCmdCancelled));
            }
        }

        // Check whether this is the last client
        uint32_t key = Hwi_disable();
        if (nClients && (--nClients == 0))
        {
            Hwi_restore(key);
            bInitialized = false;

            if (bRadioActive)
            {
                // Power down radio
                decActiveClientCnt(0);

                // Wait for powerdown and unregister module RTOS objects
                Semaphore_pend(Semaphore_handle(&h->state.semSync), BIOS_WAIT_FOREVER);
            }

            Semaphore_destruct(&h->state.semSync);
            Clock_destruct(&h->state.clkInactivity);
            Swi_destruct(&swiFsm);
            Hwi_destruct(&hwiCpe0);
            Swi_destruct(&swiHw);
            Hwi_destruct(&hwiHw);
            Clock_destruct(&clkPowerUp);
            pCurrClient = NULL;
            bRatActive = false;
            if (h->clientConfig.bPowerUpXOSC == true)
            {
                Power_releaseDependency(PowerCC26XX_XOSC_HF);
            }
        }
        else
        {
            Hwi_restore(key);

            // If we're the current RF client, stop being it
            if (pCurrClient == h)
            {
                pCurrClient = NULL;
            }

            // Unregister client RTOS objects
            Semaphore_destruct(&h->state.semSync);
            Clock_destruct(&h->state.clkInactivity);
        }
    }
}


uint32_t RF_getCurrentTime(void)
{
    uint32_t key = Hwi_disable();
    if (bRadioActive)
    {
        uint32_t ratCnt;
        ratCnt = HWREG(RFC_RAT_BASE + RFC_RAT_O_RATCNT);
        Hwi_restore(key);
        return ratCnt;
    }
    else
    {
        Hwi_restore(key);
        uint64_t nRtc;
        nRtc  = AONRTCCurrent64BitValueGet();
        // Conservatively assume that we are just about to increment the RTC
        nRtc += RF_RTC_TICK_INC;
        // Scale with the 4 MHz that the RAT is running
        nRtc *= RF_SCALE_RTC_TO_4MHZ;
        // Add the RAT offset for RTC==0
        nRtc += ((uint64_t)opRatSync.start.rat0) << RF_SHIFT_32_BITS;
        return (uint32_t)(nRtc >> RF_SHIFT_32_BITS);
    }
}


RF_CmdHandle RF_postCmd(RF_Handle h, RF_Op* pOp, RF_Priority ePri, RF_Callback pCb, RF_EventMask bmEvent)
{
    // Get hold of an RF command container (within critical section)
    RF_Cmd* pCmd;
    RF_CmdHandle ch;

    //Assert
    Assert_isTrue((h != NULL), NULL);
    Assert_isTrue((pOp != NULL), NULL);


    uint32_t key = Hwi_disable();

    // Try to allocate container and handle nSeqPost/nSeqDone overflow
    if (((cmdQ.nSeqPost + N_CMD_MODMASK + 1 - cmdQ.nSeqDone) & N_CMD_MODMASK) < N_CMD_POOL)
    {
        // Allocate RF_Op container
        cmdQ.nSeqPost = (cmdQ.nSeqPost + 1) & N_CMD_MODMASK;
        ch = cmdQ.nSeqPost;

        pCmd = allocCmd(ch);
    }
    else
    {
        // No more RF command containers available -> set status and return error code
        Hwi_restore(key);
        return (RF_CmdHandle)RF_ALLOC_ERROR;
    }

    // Stop inactivity clock if running
    Clock_stop(Clock_handle(&h->state.clkInactivity));

    // Populate RF_Op container
    pCmd->pOp = pOp;
    pCmd->ePri = ePri;
    pCmd->pCb = pCb;
    pCmd->ch = ch;
    pCmd->pClient = h;
    pCmd->bmEvent = bmEvent & ~RF_INTERNAL_IFG_MASK;
    pCmd->flags = 0;

    if (cmdQ.pPend)
    {
        // Submit to pending command queue
        if (Q_push(&cmdQ.pPend, pCmd) == false)
        {
            cmdQ.nSeqPost = (N_CMD_MODMASK + cmdQ.nSeqPost) & N_CMD_MODMASK;
            Hwi_restore(key);
            return (RF_CmdHandle)RF_ALLOC_ERROR;
        }

        h->state.chLastPosted = ch;
        pCmd->flags |= RF_CMD_ALLOC_FLAG;
        Hwi_restore(key);
        return ch;
    }

    // Submit to pending command queue
    if (Q_push(&cmdQ.pPend, pCmd) == false)
    {
        cmdQ.nSeqPost = (N_CMD_MODMASK + cmdQ.nSeqPost) & N_CMD_MODMASK;
        Hwi_restore(key);
        return (RF_CmdHandle)RF_ALLOC_ERROR;
    }

    h->state.chLastPosted = ch;
    pCmd->flags |= RF_CMD_ALLOC_FLAG;

    // reset yield flag
    h->state.bYielded = false;
    if (bYieldPwrDnCalled && bRadioActive)
    {
        bYieldPwrDnCancel = true;
        bYieldPwrDnCalled = false;
        bInitAvailRatCh = false;
        nActiveClients++;
    }
    Hwi_restore(key);

    // Trigger dispatcher HWI if there is no running command
    if (!cmdQ.pCurrCmd)
    {
        if (bRadioActive)
        {
            Hwi_post(INT_RFC_CPE_0);
        }
        else if (!bPowerUpActive)
        {
            // Wakeup radio. FSM will trigger dispatch again when powered up
            key = Hwi_disable();
            if (bPowerDownActive)
            {
                bRestart = true;
                Hwi_restore(key);
            }
            else if ((dispatchInUs = dispatchOpWhen(pCmd->pOp)))
            {
                Clock_setTimeout(Clock_handle(&clkPowerUp), (dispatchInUs-(pCurrClient->clientConfig.nPowerUpDuration))/ Clock_tickPeriod);
                Clock_start(Clock_handle(&clkPowerUp));
                Hwi_restore(key);
            }
            else
            {
                Hwi_restore(key);
                Swi_or(Swi_handle(&swiFsm), Fsm_EventWakeup);
            }
        }
    }
    return ch;
}

RF_EventMask RF_pendCmd(RF_Handle h, RF_CmdHandle ch, RF_EventMask bmEvent)
{
    //Assert
    Assert_isTrue((h != NULL), NULL);
    Assert_isTrue((ch >= 0), NULL);


